
from utils.utility import *


sourceStr = "《橙黄橘绿半甜时》是一本品味人生的甜酸苦辣、品味四季变换的清香淡雅的诗意散文选。原文提到的忽晴、忽雨、乍暖、乍寒的描述，就好像是我们生活中的起落变换，繁杂复杂苦涩中却又藏着生活的甜美。各位大家以文字勾勒出的四季，万象，更是赋予了我们对生活深深的热爱。\
\
犹如文中所说，西洋的“May”是物质的、实利的，东洋的“春”则是精神的、艺术的。在这互相衔接的散文选集中，我们亦可见到东西文化的融合和对比。明眼人一看便知，作者们不仅想让读者品味四季的韵味，还借此机会赞美并阐述中华文化的博大精深。\
\
这是一本如诗如画的书，每一篇都是一幅画，每一章都是一首诗。在品读这些作家的才情和心境时，我们仿佛置身于一个淡雅清新的世界里，普通的生活被赋予了新的意义和目标。这些散文，简洁优雅，不仅讲述了生活，更讲述了我们怎样去生活。这些美好的、悲叹的、浪漫的、让人会心一笑的故事，你会发现，原来生活就在这些平淡中的起伏波澜处。它们真实、质朴，拥有着那么强大的力量，可以抚平我们心中的创伤，让我们在困倦时找到安慰，在喜乐时分享快乐。一部描绘季节更迭与生活纷呈的佳作，值得我们细细品味。"


result = Utility.sliceStringWithSentence(inStr=sourceStr)
print("done")
